In [1]:
import pandas as pd
import numpy as np

In [30]:
#62
'''Write a Pandas program to remove first n rows of a given DataFrame.'''
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]})
n = int(input('enter number of rows : '))
df.drop(df.head(n).index)

enter number of rows : 3

   col1  col2  col3
3     4     9    12
4     7     5     1
5    11     0    11

In [32]:
#63
'''Write a Pandas program to remove last n rows of a given DataFrame'''
df = pd.DataFrame({'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]})
df.drop(df.tail(n).index)

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8

In [37]:
#64
'''Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame'''
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
print(df.add_prefix('col_'))
print(df.add_suffix('_1'))

   col_W  col_X  col_Y  col_Z
0     68     78     84     86
1     75     85     94     97
2     86     96     89     96
3     80     80     83     72
4     66     86     86     83
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [42]:
#65
'''Write a Pandas program to reverse order (rows, columns) of a given DataFrame.'''
print('reversed rows :')
print(df[::-1])
print('reversed columns :')
print(df.sort_index(axis=1,ascending=False))

reversed rows :
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86
reversed columns :
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66

In [56]:
#66
'''Write a Pandas program to select columns by data type of a given DataFrame.'''
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print('numerical columns :')
print(df.select_dtypes(include='number'))
print('object columns :')
print(df.select_dtypes(include='object'))

numerical columns :
    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0
object columns :
             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

In [69]:
#67
''' Write a Pandas program to split a given DataFrame into two random subsets'''
subset1 = df.sample(2)
subset2 = df.drop(subset1.index)
print('subset1 :')
print(subset1)
print('subset2 :')
print(subset2)

subset1 :
             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
3    Eesha Hinton    11/05/2002  22.0
subset2 :
           name date_of_birth   age
1  Gino Mcneill    16/02/1999  21.2
2   Ryan Parkes    25/09/1998  22.5
4  Syed Wharton    15/09/1997  23.0

In [73]:
#68
'''Write a Pandas program to rename all columns with the same pattern of a given DataFrame'''
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]})
df.columns = df.columns.str.lower()
df

             name date_of_birth    age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [76]:
#71
'''Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame'''
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            5 non-null      object
 1   date_of_birth   5 non-null      object
 2   age             5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 849.0 bytes

In [80]:
#72
'''Write a Pandas program to combine many given series to create a DataFrame.'''
s1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
s2 = pd.Series([1, 2, 3, 4, 5])
pd.concat([s1,s2],axis=1)

        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5